Revit 2027 API
StructuralSectionUtils.GetStructuralSection Method
 Return structural section from element.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static StructuralSection GetStructuralSection(
	Document document,
	ElementId elementId
)
Public Shared Function GetStructuralSection (
	document As Document,
	elementId As ElementId
) As StructuralSection
public:
static StructuralSection^ GetStructuralSection(
	Document^ document,
	ElementId^ elementId
)
static member GetStructuralSection :
        document : Document *
        elementId : ElementId -> StructuralSection
Parameters
document Document
 The document that owns the family for beam, brace or structural column.
elementId ElementId
 ID of family symbol or family instance for beam, brace or structural column.
Return Value
StructuralSection
 Structural section returned if element have one. For elements that do not have structural section or can not have structural section null will be returned.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 Only beams, braces and structural columns can have structural section associated with it.
See Also
Reference
StructuralSectionUtils Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace